RetroBSD/2.11BSD/usr/usr.sbin/mklost+found/mklost+found.8
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)mklost+found.8	6.1 (Berkeley) 4/27/85
.\"
.TH MKLOST+FOUND 8 "November 17, 1996"
.UC 4
.SH NAME
mklost+found \- make a lost+found directory for fsck
.SH SYNOPSIS
.B /usr/sbin/mklost+found
.SH DESCRIPTION
A directory
.I lost+found
is created in the current directory and a number of empty files
are created therein and then removed so that there will be
empty slots for
.IR fsck (8).
.PP
This command is obsolete because
.IR fsck (8)
automatically creates and extends the
.I lost+found
directory as needed.
.SH "SEE ALSO"
fsck(8),
mkfs(8)
