RetroBSD/2.11BSD/usr/usr.sbin/implogd/implogd.8
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)implogd.8	6.2.1 (2.11BSD) 1996/11/16
.\"
.TH IMPLOGD 8 "November 16, 1996"
.UC 5
.SH NAME
implogd \- IMP logger process
.SH SYNOPSIS
.B /usr/sbin/implogd
[
.B \-d
]
.SH DESCRIPTION
.I Implogd
is program which logs error messages from the IMP,
placing them in the file
.IR /usr/adm/implog .
.PP
Entries in the file are variable length.  Each log
entry has a fixed length header of the form:
.PP
.ta 0.5i 1.0i 1.5i
.nf
struct sockstamp {
	short	sin_family;
	u_short	sin_port;
	struct	in_addr sin_addr;
	time_t	sin_time;
	int	sin_len;
};
.fi
.PP
followed, possibly, by the message received from the 
IMP.  Each time the logging process is started up it
places a time stamp entry in the file (a header with
.I sin_len
field set to 0).
.PP
The logging process will catch only those message from
the IMP which are not processed by a protocol module,
e.g. IP.  This implies the log should contain only
status information such as ``IMP going down'' messages,
``host down'' and other error messages,
and, perhaps, stray NCP messages.
.SH "SEE ALSO"
imp(4P),
implog(8C)
