RetroBSD/2.11BSD/usr/sbin/ncheck/ncheck.8
.TH NCHECK 8
.UC
.SH NAME
ncheck  \-  generate names from i-numbers
.SH SYNOPSIS
.B ncheck
[
.B \-i
numbers ]  [
.B \-a
] [
.B \-s
]  [ filesystem ]
.SH DESCRIPTION
.I Ncheck
with no argument
generates a pathname vs. i-number
list of all files
on a set of default file systems.
Names of directory files are followed by `/\fB.\fP'.
The
.B \-i
option reduces the report to only those files whose i-numbers follow.
The
.B \-a
option
allows printing of the names
.RB ` . '
and
.RB ` .. ',
which are ordinarily suppressed.
The
.B \-s
option reduces the report to special files
and files with set-user-ID mode;
it is intended to discover concealed violations
of security policy.
.PP
A file system may be specified.
.PP
The report is in no useful
order, and probably should be sorted.
.SH "SEE ALSO"
sort(1), dcheck(8), fsck(8), icheck(8)
.SH DIAGNOSTICS
When the file system structure is improper,
`??' denotes the `parent' of
a parentless file and
a pathname beginning with `...' denotes a loop.
