RetroBSD/2.11BSD/usr/old/arcv/arcv.8
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)arcv.8	6.1.1 (2.11BSD) 1996/11/27
.\"
.TH ARCV 8 "November 27, 1996"
.UC 4
.SH NAME
arcv \- convert archives to new format
.SH SYNOPSIS
.B arcv
file ...
.SH DESCRIPTION
.I Arcv
converts archive files
(see
.IR ar (1),
.IR ar (5))
from 32v and Third Berkeley editions to a new portable format.
The conversion is done in place, and the command
refuses to alter a file not in old archive format.
.PP
Old archives are marked with a magic number of 0177545 at the start;
new archives have a first line ``!<arch>''.
.SH FILES
/tmp/v*, temporary copy
.SH SEE ALSO
ar(1), ar(5)
