RetroBSD/2.11BSD/usr/sbin/dmesg/dmesg.8
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)dmesg.8	6.2.1 (2.11BSD) 1996/11/17
.\"
.TH DMESG 8 "November 17, 1996"
.UC 4
.SH NAME
dmesg \- collect system diagnostic messages to form error log
.SH SYNOPSIS
.B /sbin/dmesg
[ \- ]
.SH DESCRIPTION
.B N.B.:
.I Dmesg
is obsoleted by
.IR syslogd (8)
for maintenance of the system error log.
.PP
.I Dmesg
looks in a system buffer for recently printed diagnostic messages
and prints them on the standard output.
The messages are those printed or logged
by the system when errors occur.
If the
.B \-
flag is given, then
.I dmesg
computes (incrementally) the new messages since the last time it
was run and places these on the standard output.
.SH FILES
.ta 2i
/usr/adm/msgbuf	scratch file for memory of \- option
.SH SEE ALSO
syslogd(8)
