RetroBSD/2.11BSD/usr/sbin/slattach/slattach.8
.\"	@(#)slattach.8	6.1.1 (2.11BSD) 1996/11/17
.TH SLATTACH 8 "November 17, 1996"
.UC 6
.SH NAME
slattach \- attach serial lines as network interfaces
.SH SYOPNSIS
.B slattach
ttyname [
.I baudrate
]
.SH DESCRIPTION
.I Slattach
is used to assign a tty line to a network interface,
and to define the network source and destination addresses. The
.I ttyname
parameter is a string of the form ``ttyXX'', or ``/dev/ttyXX''.
The optional
.I baudrate
parameter is used to set the speed of the connection. If not specified, the
default of 9600 is used.
.PP
Only the super-user may attach a network interface.
.PP
To detach the interface, use `ifconfig
.I interface-name
down' after killing off the
.I slattach
process.
.I interface-name
is the name that is shown by
.B netstat(1)
.SH EXAMPLES
.ta 8
	slattach ttyh8
.br
	slattach /dev/tty01 4800
.SH DIAGNOSTICS
Messages indicating the specified interface does not exit, the
requested address is unknown, the user is not privileged and
tried to alter an interface's configuration.
.SH "SEE ALSO"
rc(8), intro(4), netstat(1), ifconfig(8)
