RetroBSD/2.11BSD/usr/sbin/badsect/badsect.8
.TH BADSECT 8
.UC
.SH NAME
badsect \- create files to contain bad sectors
.SH SYNOPSIS
.B /sbin/badsect
sector ...
.SH DESCRIPTION
.I Badsect
makes a file to contain a bad sector.  Normally, bad sectors
are made inaccessible by the standard formatter, which provides
a forwarding table for bad sectors to the driver; see
.IR bad144 (8)
for details.
If a driver supports the bad blocking standard it is much preferable to
use that method to isolate bad blocks, since the bad block forwarding
makes the pack appear perfect, and such packs can then be copied with
.IR dd (1).
The technique used by this program is also less general than
bad block forwarding, as
.I badsect
can't make amends for
bad blocks in the i-list of file systems or in swap areas.
.PP
Adding a sector which is suddenly bad to the bad sector table
currently requires the running of the standard DEC formatter, as
UNIX does not supply formatters.  Thus to deal with a newly bad block
or on disks where the drivers
do not support the bad-blocking standard 
.I badsect
may be used to good
effect.
.PP
.I Badsect
is used on a quiet file system in the following way:
First mount the file system, and change to its root directory.
Make a directory BAD there and change into it.  Run badsect
giving as argument all the bad sectors you wish to add.
(The sector numbers should be given as physical disk sectors
relative to the beginning of the file system,
exactly as the
system reports the sector numbers in its console error messages.)
Then change back to the root directory, unmount the file system
and run
.IR fsck (8)
on the file system.  The bad sectors should show up in two files
or in the bad sector files and the free list.  Have
.I fsck
remove files containing the offending bad sectors, but 
.B "do not"
have it remove the BAD/\fInnnnn\fR files.
This will leave the bad sectors in only the BAD files.
.PP
.I Badsect
works by giving the specified sector numbers in a
.IR mknod (2)
system call (after taking into account the filesystem's block size),
creating a regular file whose first block address is the block containing
bad sector and whose name is the bad sector number.
The file has 0 length, but the check programs
will still consider it to contain the block containing the sector.
This has the pleasant effect that the sector is completely inaccessible
to the containing file system
since it is not available by accessing the file.
.PP
.SH SEE ALSO
mknod(2), bad144(8), fsck(8)
.SH BUGS
If both sectors which comprise a (1024 byte) disk block are bad,
you should specify only one of them to
.I badsect,
as the blocks in the bad sector files actually cover both (bad)
disk sectors.
.PP
On the PDP-11, only sector number less than
131072 may be specified on 1024-byte block filesystems,
65536 on 512-byte block filesystems.
This is because only a short int is passed to the system from
.IR mknod .
