RetroBSD/2.11BSD/usr/new/notes/man/newsoutput.8
.TH NEWSOUTPUT 8 "University of Illinois"
.SH NAME
newsoutput, newsinput - notes/news gateway programs
.SH SYNOPSIS
.B newsoutput
[
.B "-a"
or 
.BI "-s" sysname
or
.B "-c"
.I "filename"
] [
.B "-b"
] [
.B "-v"
] [
.B "-o"
.I date-spec
] [
.B "-f"
file
]
topic [ ... ]
.PP
.B newsinput
[
.B "-t"
] [
.B "-1"
]
.SH DESCRIPTION
.I Newsoutput
and
.I newsinput
manage the transfer of articles between a notesfile system
and a news system.

.I Newsoutput
gateways notesfile-generated articles to the news system.
Several options determine the types of articles to be
transfered.
The
.B -a
option specifies that any notesfile-generated article that
has not been in the news system before is to be sent to 
news.
The
.BI "-s" "sysname"
option specifies that only articles from 
.I sysname
are to be sent to the news system.
The
.B "-c"
option directs
.I newsoutput
to gateway articles written at any of the systems whose
names appear in the file
.IB filename "."
If none of these options is specified, only locally
generated articles are sent to the news.
In normal operation, the
.B -a
or
.B -c
options are most typically used;
.B -s
is included for backwards compatibility.
.PP
The 
.B -b
option specifies that newsoutput should generate articles
which will be parsed correctly by previous versions of the
notesfile/news gateway code.
Files containing lists of notesfiles can 
be specified through the 
.B -f
option.
Use
.B -v
for a more verbose output than normal;
default operation produces a summary of notes and responses
transmitted for each notesfile with traffic.
.PP
The
.B -o
option specifies that only articles that arrived on the 
local system after
.I date-spec
are to be considered for transmittal to news.
The timestamp file is updated after the execution of 
.I newsoutput
whether the 
.B -o
option is specified.
.PP
The actual method of insertion into the news system is determined
in the ``net.how'' file by the transmission method for the
pseudo-site ``Usenet''.
Mappings between notesfiles and newsgroups are specified in the
file ``/usr/spool/notes/.utilities/newsgroups''.
.PP
The
.I newsinput
program accepts articles from the news system,
parses headers,
maps newsgroups to appropriate notesfiles,
and inserts the articles.
News' control messages are intercepted and placed in a 
maintainence notesfile for review by the system manager.
When a news article maps to a non-existent notesfile,
the notesfile is automatically created.
.PP
The
.B "-t"
directs
.I newsinput
to NOT log cases where the
.I "Message-Id"
is longer than the reserved space in the note descriptor.
These occurences are normally logged in the nfmaint notesfile.
The
.B "-1"
option directs
.I newsinput
to place the article in the first notesfile on the
.I "Newsgroups"
line.
The normal action is to place a copy of the article in each notesfile
specified on the
.I "Newsgroups"
line.
.PP
Typically
.I newsoutput
is run by cron(8) at intervals ranging from hourly to daily.
Newsinput is invoked automatically by the news system when
it propogates articles. 
See appendix B of 
.ul
The Notesfile Reference Manual
for a more detailed discussion on configuring and installing
a notesfile-news gateway.
.PP
The notesfile-news mapping function used the file
/usr/spool/notes/.utilities to map names between the two systems.
The mapping functions allow simple one-for-one name mapping,
one-to-many mapping,
and 
mapping ``basenotes'' and responses from one notesfile to 
separate newsgroups.
See appendix B of
.ul
The Notesfile Reference Manual
for more information on how this works.
.SH BUGS
News articles which can definitely be marked as responses
because they have a ``References'' line but whose parents
can't be found by article-ID or by guessing from the title
are not counted as orphans.
This is due to problems arising from mapping of article-ID's
to allow a notesfile and news system to coexist on the
same host.
.PP
newsinput doesn't correctly do one-to-many mapping of
newsgroups to notesfiles.  Newsoutput does do
one-to-many mapping of notesfiles to newsgroups.
.PP
Since the author's system may not have seen the article yet 
(if he wrote it via nfmail for example), the ``Path:'' header
line may not point anywhere near the author.
.PP
The ``Path'' line generated contains full-domain information
and doesn't necessarily point at the author.  News systems
2.10.2 and earlier still assume that the last component of
this header line is an author name and treat it specially.
.PP
The Message-Id field is set at 32 bytes in Notes 1.7.
This should be made longer.
64 bytes is probably adequate.
.PP
Because colons are used as delimiters in the notesfile
transfer format, Message-Id's with colons are declared
"UnManageable" and ignored.
.SH FILES
.PD 0
.TP 40
/usr/spool/notes/.utilities
where these programs live.
.TP 40
/usr/spool/notes/.utilities/newsgroups
mapping between notesfiles and newsgroups
.TP 40
/usr/spool/notes/.utilities/net.how
Pseudo-site ``Usenet'' specifies how to insert news
articles.
.PD
.SH SEE ALSO
news(1),
notes(1),
nfxmit(8),
uucp(1),
.br
.ul
The Notesfile Reference Manual
.SH AUTHORS
.nf
Ray Essick (uiucdcs!essick, essick%uiuc@csnet-relay.arpa)
Department of Computer Science
University of Illinois at Urbana-Champaign
Urbana, IL
.sp
Rob Kolstad (kolstad@convex.UUCP)
CONVEX Computer Corporation
Richardson, TX
.fi
