RetroBSD/2.11BSD/usr/new/notes/man/nfmail.8
.TH NFMAIL 8 "University of Illinois"
.SH NAME
nfmail \- accept mail for a notesfile
.SH SYNOPSIS
.B nfmail
[
.B "-F"
] [
.B "-s"
] [
.B "-d"
] [
.B "-m"
mailrc
]
topic
.SH DESCRIPTION
.I Nfmail
is a mail-receiving program which takes incoming mail, parses
subject and author information, and places the letter in
a notesfile.
Replies, marked by a ``Re:'' prefix in the Subject line,
are placed in the notesfile as responses if a basenote with
the appropriate title can be found.
Normally, the matching of titles based on the ``Re:'' prefixes is
done so that a match only occurs when the basenote titles starts
with the remainder of the string.
Thus, ``Re: this'' will match as a response of the 
basenote ``this is it'', but will not match a basenote
titled ``see this note''.
Specify the
.B -F
option if you wish to remove the restriction that matches start
at the beginning of the title.
.PP
The 
.B "-s"
option tells
.I nfmail
to strip header lines from the letter before placing it in
the notesfile.
Normally, all header information is retained.
The ``Subject'', and ``From'' header lines are never removed from
the letter.
The file
.I "/etc/Mail.rc"
defines default mail reading characteristics on many BSD systems.
This file can contain lists of header lines to be ignored when
presenting messages to users.
.I Nfmail
reads this file to determine which header lines are normally ignored.
If this file is missing,
.I nfmail
doesn't strip any header lines.
.PP
The 
.B "-m"
option specifies further files, typically ``.mailrc'' files,
to search for header lines to ignore.
More than one
.B "-m"
option can appear on the command line.
.PP
Use the
.B "-d"
option when you want the inserted note or response to be flagged as
a director message.
.PP
.I Nfmail
usually appears as a mail alias in the file ``/etc/aliases''
in lines such as:

problems:	"|/usr/spool/notes/.utilities/nfmail -s problems"
.SH BUGS
.PP
The dependence on ``/etc/Mail.rc'' for lists of headers to be ignored
should be cleaned up.
Perhaps something where absence of the file
means to strip all headers except the Subject and From lines.
.SH FILES
.PD 0
.TP 40
/usr/spool/notes/.utilities/nfmail
where this program lives.
.TP 40
/etc/aliases
Mail aliases (BSD UNIX)
.TP 40
/etc/Mail.rc
Mail configuration templates
.PD
.SH SEE ALSO
delivermail(8),
notes(1),
Mail(1),
sendmail(8),
.br
.ul
The Notesfile Reference Manual
.SH AUTHORS
.nf
Ray Essick (uiucdcs!essick, essick%uiuc@csnet-relay.arpa)
Department of Computer Science
University of Illinois at Urbana-Champaign
Urbana, IL
.sp
Rob Kolstad (kolstad@convex.UUCP)
CONVEX Computer Corporation
Richardson, TX
.fi
