RetroBSD/2.11BSD/usr/usr.sbin/implog/implog.8
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)implog.8	6.2.1 (2.11BSD) 1996/11/16
.\"
.TH IMPLOG 8 "November 16, 1996"
.UC 5
.SH NAME
implog \- IMP log interpreter
.SH SYNOPSIS
.B /usr/sbin/implog
[
.B \-D
] [
.B \-f
] [
.B \-c
] [
.B \-r
] [
.B \-l
[
.I link
] ] [
.B \-h
.I host#
] [
.B \-i
.I imp#
] [
.B \-t
.I message-type
]
.SH DESCRIPTION
.I Implog
is program which interprets the message log produced by
.IR implogd (8C).
.PP
If no arguments are specified, 
.I implog
interprets and prints every message present in the message
file.  Options may be specified to force printing only a
subset of the logged messages.
.TP
.B \-D
Do not show data messages. 
.TP
.B \-f
Follow the logging process in action.  This flags causes
.I implog
to print the current contents of the log file, then
check for new logged messages every 5 seconds. 
.TP
.B \-c
In addition to printing any data messages logged, show the
contents of the data in hexadecimal bytes.
.TP
.B \-r
Print the raw imp leader, showing all fields,
in addition to the formatted interpretation according to type.
.TP
\fB\-l\fP [ \fIlink\fP# ]
Show only those messages received on the specified ``link''.  If
no value is given for the link, the link number of the IP protocol
is assumed.
.TP
\fB\-h\fP \fIhost\fP#
Show only those messages received from the specified host.
(Usually specified in conjunction with an imp.)
.TP
\fB\-i\fP \fIimp\fP#
Show only those messages received from the specified imp.
.TP
\fB\-t\fP \fImessage-type\fP
Show only those messages received of the specified message type.
.SH "SEE ALSO"
imp(4P),
implogd(8C)
.SH BUGS
Can not specify multiple hosts, imps, etc.
Can not follow reception of messages without looking at
those currently in the file.
