RetroBSD/2.11BSD/usr/sbin/restor/restor.8
.TH RESTOR 8
.UC
.SH NAME
restor \- incremental file system restore
.SH SYNOPSIS
.I restor
key [ argument ... ]
.SH DESCRIPTION
.I Restor
is used to read magtapes dumped with the
.I dump
command.
The
.I key
specifies what is to be done.
.I Key
is one of the characters
.B rRxt
optionally combined with
.BR f .
.TP
.B  f
Use the first
.I argument
as the name of the tape instead
of the default.
.TP
.B  r or R
The tape
is read and loaded into the file system
specified in
.I argument.
This should not be done lightly (see below).
If the key is
.B R
.I restor
asks which tape of a multi volume set to start on.
This allows restor to be interrupted and then
restarted (an
.I icheck
\-s must be done before restarting ).
.TP
.B  x
Each file on the
tape named by an 
.I argument
is extracted.
The file name has all `mount' prefixes removed;
for example, /usr/bin/lpr is named /bin/lpr on the tape.
The file extracted is placed in a file with a numeric name
supplied by
.I restor
(actually the inode number).
In order to keep the amount of tape read to a minimum,
the following procedure is recommended:
.sp
Mount volume 1 of the set of dump tapes.
.sp
Type the
.I restor
command.
.sp
.I Restor
will announce whether or not it found the files,
give the number it will name the file, and rewind the tape.
.sp
It then
asks you to `mount the desired tape volume'.
Type the number of the volume you choose.
On a
multivolume dump the recommended procedure is to mount the
last through the first volume in that order.
.I Restor
checks to see if any of the files requested are on the
mounted tape (or a later tape, thus the reverse order) and doesn't
read through the tape if no files are.
If you are working with a single volume dump or the number of files
being restored is large, respond to the query with `1' and
.I restor
will read the tapes in sequential order.
.sp
If you have a hierarchy to restore you can use
.IR dumpdir (8)
to produce the list of names and a shell script to move
the resulting files to their homes.
.TP
.B t
Print the date the tape was written and the date
the file system was dumped from.
.PP
The
.B r
option should only be used to restore
a complete dump tape onto a clear file system
or to restore an incremental dump tape onto this.
Thus
.PP
	mkfs /dev/hp0a 4807
.br
	restor r /dev/hp0a
.PP
is a typical sequence to restore a complete dump.
Another
.I restor
can be done to get an incremental dump
in on top of this.
.PP
A
.I dump
followed by a
.I mkfs
and a
.I restor
is used to
change the size of a file system.
.SH FILES
.ta 2i
/dev/rmt1	default file name
.br
rst*	temporary files
.SH "SEE ALSO"
dump(8), dumpdir(8), mkfs(8)
.SH DIAGNOSTICS
There are various diagnostics
involved with reading the tape and writing the disk.
There are also diagnostics if the i-list or the free list
of the file system is not large enough to hold the dump.
.PP
If the dump extends over more than one tape,
it may ask you to change tapes.
Reply with a newline when the next tape has been mounted.
.PP
Dump tapes made before the new ondisc directory structure will
be converted automatically by
.I restor .
.SH BUGS
There is redundant information on the tape
that could be used in case of tape reading problems.
Unfortunately,
.IR restor " 
does't use it.
